FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1768/LPC1768_I2C.c
/*-------------------------------------------------------------------------*
 * File:  I2C.c
 *-------------------------------------------------------------------------*
 * Description:
 *      HAL implementation of the LPC1768 I2C Interface.
 * Implementation:
 *      A single I2C0 is created, but the code can be easily changed for
 *      other processors to use multiple I2C busses.
 *-------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------
 * uEZ(R) - Copyright (C) 2007-2015 Future Designs, Inc.
 *--------------------------------------------------------------------------
 * This file is part of the uEZ(R) distribution.  See the included
 * uEZ License.pdf or visit http://goo.gl/UDtTCR for details.
 *
 *    *===============================================================*
 *    |  Future Designs, Inc. can port uEZ(r) to your own hardware!   |
 *    |             We can get you up and running fast!               |
*    |      See http://goo.gl/UDtTCR for more details.               |
 *    *===============================================================*
 *
 *-------------------------------------------------------------------------*/
#include <uEZ.h>
#include <HAL/Interrupt.h>
#include <uEZProcessor.h>
#include <Source/Processor/NXP/LPC1768/LPC1768_I2C.h>
#include <uEZPlatformAPI.h>

// Setup Master mode only.  Slave mode is a future version but we'll
// leave some of the code in so we don't have to write it later.
#define COMPILE_I2C_MASTER_MODE 1
#define COMPILE_I2C_SLAVE_MODE  0

/*---------------------------------------------------------------------------*
 * Types:
 *---------------------------------------------------------------------------*/
// I2CONSET:
    // Assert acknowledge flag
    #define I2CONSET_AA     (1<<2)
    // I2C interrupt flag
    #define I2CONSET_SI     (1<<3)
    // STOP flag
    #define I2CONSET_STO    (1<<4)
    // START flag
    #define I2CONSET_STA    (1<<5)
    // I2C interface enable
    #define I2CONSET_I2EN   (1<<6)
// I2STAT:
    // Status
    #define I2STAT_STATUS_MASK  (0x1F<<3)
// I2DAT:
// I2ADR:
    #define I2ADR_GC        (1<<0)
// I2SCLH:
// I2SCLL:
// I2CONCLR:
    // Assert acknowledge Clear bit
    #define I2CONCLR_AAC    (1<<2)
    // I2C interrupt Clear bit
    #define I2CONCLR_SIC    (1<<3)
    // START flag Clear bit
    #define I2CONCLR_STAC   (1<<5)
    // I2C interface Disable bit
    #define I2CONCLR_I2ENC  (1<<6)

typedef struct {
    const HAL_I2CBus *iHAL;
    LPC_I2C_TypeDef *iRegs;
    I2C_Request *iRequest;
    TUInt8 iAddress;
    TUInt8 *iData;
    TUInt8 iDataLen;
    TUInt8 iIndex;
    I2CRequestCompleteCallback iCompleteFunc;
    void *iCompleteWorkspace;
    T_uezGPIOPortPin iSDAPin;
    T_uezGPIOPortPin iSCLPin;

    volatile TBool iDoneFlag;
#if COMPILE_I2C_SLAVE_MODE
    I2CSlaveIsLastReceiveByte iI2CSlaveIsLastReceiveByte;
    I2CSlaveIsLastTransmitByte iI2CSlaveIsLastTransmitByte;
    I2CTransferComplete iI2CTransferComplete;
    I2CSlaveReceiveByte iI2CSlaveReceiveByte;
    I2CSlaveGetTransmitByte iI2CSlaveGetTransmitByte;
#endif
} T_LPC1768_I2C_Workspace;

typedef TUInt8 T_lpc1768_i2cMode;
#define I2C_MODE_READ           1
#define I2C_MODE_WRITE          0

/*-------------------------------------------------------------------------*
 * Macros:
 *-------------------------------------------------------------------------*/
#define I2C_ENABLE(p)       (((p)->iRegs)->I2CONSET) = I2CONSET_I2EN
#define I2C_DISABLE(p)      (((p)->iRegs)->I2CONCLR) = I2CONCLR_I2ENC
#define STA_SET(p)          (((p)->iRegs)->I2CONSET) = I2CONSET_STA
#define STA_CLEAR(p)        (((p)->iRegs)->I2CONCLR) = I2CONCLR_STAC
#define STO_SET(p)          (((p)->iRegs)->I2CONSET) = I2CONSET_STO
#define STO_CLEAR(p)        /* automatically cleared by hardware */
#define AA_SET(p)           (((p)->iRegs)->I2CONSET) = I2CONSET_AA
#define AA_CLEAR(p)         (((p)->iRegs)->I2CONCLR) = I2CONCLR_AAC
#define SI_CLEAR(p)         (((p)->iRegs)->I2CONCLR) = I2CONCLR_SIC
#define I2DAT_WRITE(p, v)   (((p)->iRegs)->I2DAT) = (v)
#define I2DAT_READ(p)       (((p)->iRegs)->I2DAT)

/*-------------------------------------------------------------------------*
 * Globals:
 *-------------------------------------------------------------------------*/
static T_LPC1768_I2C_Workspace *G_lpc1768_i2c0Workspace;
static T_LPC1768_I2C_Workspace *G_lpc1768_i2c1Workspace;
static T_LPC1768_I2C_Workspace *G_lpc1768_i2c2Workspace;

static const T_LPC1768_IOCON_ConfigList G_sda1[] = {
    {GPIO_P0_0,     IOCON_I_DEFAULT(3) },
    {GPIO_P0_19,    IOCON_I_DEFAULT(3) },
};
static const T_LPC1768_IOCON_ConfigList G_scl1[] = {
    {GPIO_P0_1,     IOCON_I_DEFAULT(3) },
    {GPIO_P0_20,    IOCON_I_DEFAULT(3) },
};

static const T_LPC1768_IOCON_ConfigList G_sda2[] = {
    {GPIO_P0_10,    IOCON_I_DEFAULT(2) },
};
static const T_LPC1768_IOCON_ConfigList G_scl2[] = {
    {GPIO_P0_11,    IOCON_I_DEFAULT(2) },
};

/*-------------------------------------------------------------------------*
 * Function Prototypes:
 *-------------------------------------------------------------------------*/
IRQ_ROUTINE(ILPC1768_I2C0InterruptHandler);
IRQ_ROUTINE(ILPC1768_I2C1InterruptHandler);
IRQ_ROUTINE(ILPC1768_I2C2InterruptHandler);
void ILPC1768_ProcessState(T_LPC1768_I2C_Workspace *p);

/*-------------------------------------------------------------------------*/
#if 0
void I2CTest(T_LPC1768_I2C_Workspace *p)
{
    uint32_t addr;
    uint32_t key;
    volatile uint32_t I2STAT;

    // Set clock rate to 100 kHz (based on 208 MHz)
    p->I2SCLH = (520*((100*Fpclk)/208))/I2C_SPEED;
    p->I2SCLL = (520*((100*Fpclk)/208))/I2C_SPEED;
    p->I2CONSET = 0x1;

    // Look through all the addresses
    for (addr=1; addr<127; addr++)  {
//        I2CWrite(p, (addr<<1)|I2C_START);
        p->I2CONSET |= 0x01;
        I2CStart(p, addr, I2C_MODE_READ);
        if (I2CWait(p))
            ConsolePrintf("\nDevice @ addr 0x%02X", addr<<1);

