FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1768/LPC1768_I2C.c
    }
}
#endif

#if COMPILE_I2C_SLAVE_MODE
static TBool ILPC1768_I2CSlaveIsLastReceiveByte(T_LPC1768_I2C_Workspace *aWorkspace)
{
    if (aWorkspace->iIndex >= aWorkspace->iDataLen)
        return ETrue;
    return EFalse;
}

static TBool ILPC1768_I2CSlaveIsLastTransmitByte(T_LPC1768_I2C_Workspace *aWorkspace)
{
    if (aWorkspace->iIndex >= aWorkspace->iDataLen)
        return ETrue;
    return EFalse;
}

static void ILPC1768_I2CTransferComplete(T_LPC1768_I2C_Workspace *aWorkspace)
{
    // Do nothing
//    PARAM_NOT_USED(aWorkspace);
}

static void ILPC1768_I2CSlaveReceiveByte(T_LPC1768_I2C_Workspace *aWorkspace, TUInt8 aByte)
{
    // Only store if there is room
    if (aWorkspace->iIndex < aWorkspace->iDataLen)
        aWorkspace->iData[aWorkspace->iIndex] = aByte;
}

static TUInt8 ILPC1768_I2CSlaveGetTransmitByte(T_LPC1768_I2C_Workspace *aWorkspace)
{
    // Only read from memory if in bounds
    if (aWorkspace->iIndex < aWorkspace->iDataLen)
        return aWorkspace->iData[aWorkspace->iIndex];
    return 0;
}
#endif

void ILPC1768_I2CSetSpeed(LPC_I2C_TypeDef *aRegs, TUInt16 aSpeed)
{
    // Calculate the speed value to use
    TUInt16 v;

    // Calculate from kHz to cycles (based on PCLK)
    v = (PROCESSOR_OSCILLATOR_FREQUENCY/1000) / aSpeed;

    // Set 50% duty cycle
    aRegs->I2SCLL = v/2;
    aRegs->I2SCLH = v/2;
}

void ILPC1768_I2CInit(T_LPC1768_I2C_Workspace *p)
{
    // Clear all the flags
    p->iRegs->I2CONCLR = I2CONSET_AA|I2CONSET_SI|I2CONSET_STA|I2CONSET_I2EN;

    // Program the speed
    ILPC1768_I2CSetSpeed(p->iRegs, p->iRequest->iSpeed);

    // Enable the I2C
    I2C_ENABLE(p);
}

static void ILPC1768_I2C_StartWrite(
        void *aWorkspace,
        I2C_Request *iRequest,
        void *aCallbackWorkspace,
        I2CRequestCompleteCallback aCallbackFunc)
{
    T_LPC1768_I2C_Workspace *p = (T_LPC1768_I2C_Workspace *)aWorkspace;

    // Use an address (and make sure the lowest bit is zero)
    p->iRequest = iRequest;
    p->iCompleteFunc = aCallbackFunc;
    p->iCompleteWorkspace = aCallbackWorkspace;
    p->iAddress = (p->iRequest->iAddr<<1)|I2C_MODE_WRITE;
    p->iData = (TUInt8 *)p->iRequest->iWriteData;
    p->iDataLen = p->iRequest->iWriteLength;
    p->iIndex = 0;
    p->iDoneFlag = EFalse;
    p->iRequest->iStatus = I2C_BUSY;

    // Initialize the I2C
    ILPC1768_I2CInit(p);

    // Kick off the transfer with a start bit
    STA_SET(p);
}

static void ILPC1768_I2C_StartRead(
        void *aWorkspace,
        I2C_Request *iRequest,
        void *aCallbackWorkspace,
        I2CRequestCompleteCallback aCallbackFunc)
{
    T_LPC1768_I2C_Workspace *p = (T_LPC1768_I2C_Workspace *)aWorkspace;

    // Use an address (and make sure the lowest bit is zero)
    p->iRequest = iRequest;
    p->iCompleteFunc = aCallbackFunc;
    p->iCompleteWorkspace = aCallbackWorkspace;
    p->iAddress = (p->iRequest->iAddr<<1)|I2C_MODE_READ;
    p->iData = p->iRequest->iReadData;
    p->iDataLen = p->iRequest->iReadLength;
    p->iIndex = 0;
    p->iDoneFlag = EFalse;
    p->iRequest->iStatus = I2C_BUSY;

    // Initialize the I2C
    ILPC1768_I2CInit(p);

    // Kick off the transfer with a start bit
    STA_SET(p);
}

/*-------------------------------------------------------------------------*
 * Routine:  ILPC1768_ProcessState
 *-------------------------------------------------------------------------*
 * Description:
 *      Core I2C processing (typically done in interrupt routine)
 *-------------------------------------------------------------------------*/
void ILPC1768_ProcessState(T_LPC1768_I2C_Workspace *p)
{
    TUInt8 c;
    TUInt8 status = p->iRegs->I2STAT;

//SerialSendChar(SERIAL_PORT_UART0, '$');
//SerialSendHex(SERIAL_PORT_UART0, status);
//ConsolePrintf("$%02X", status);
    switch(status)
    {
#if COMPILE_I2C_MASTER_MODE
        // Start condition tranmitted
        case 0x08:

        // Repeat start condition transmitted
        case 0x10:
            // Send the slave address
            I2DAT_WRITE(p, p->iAddress);
//            (((p)->iRegs)->I2DAT) = (p->iAddress);
            STA_CLEAR(p);
            STO_CLEAR(p);
            p->iIndex = 0;
            break;

        // MASTER TRANSMITTER
        // Slave Address + Write transmitted, and got ACK from slave
        case 0x18:
            // Transmit a byte
            I2DAT_WRITE(p, p->iData[p->iIndex]);
            STA_CLEAR(p);
            STO_CLEAR(p);
            break;

        // Slave Address transmitted, no ACK received
        case 0x20:
            // Generate a stop condition and report error status
            STA_CLEAR(p);
            STO_SET(p);
            p->iRequest->iStatus = I2C_ERROR;
            p->iDoneFlag = ETrue;
            p->iCompleteFunc(p->iCompleteWorkspace, p->iRequest);
            break;

        // Data byte written and ACK received.
        case 0x28:
            // Last byte?
            p->iIndex++;
            if (p->iIndex >= p->iDataLen) {
                // Yes, last.  Generate a stop condition
                STA_CLEAR(p);
                STO_SET(p);
                p->iRequest->iStatus = I2C_OK;
                p->iDoneFlag = ETrue;
                p->iCompleteFunc(p->iCompleteWorkspace, p->iRequest);
            } else {
                // Send the next byte
                I2DAT_WRITE(p, p->iData[p->iIndex]);
                STA_CLEAR(p);
                STO_CLEAR(p);
            }
            break;

        // Data byte written but no ACK received
        case 0x30:
            // Generate a stop condition
            STA_CLEAR(p);
            STO_SET(p);
            p->iRequest->iStatus = I2C_ERROR;
            p->iDoneFlag = ETrue;
            p->iCompleteFunc(p->iCompleteWorkspace, p->iRequest);
            break;

        // Arbitration was lost
        case 0x38:
            // Generate a start condition and try again
            STA_SET(p);
            STO_CLEAR(p);
            break;

        // MASTER RECEIVER
        // Slave address + Read sent, ACK received
        case 0x40:
            // Are we to receive more?
            STA_CLEAR(p);
            STO_CLEAR(p);
            if ((p->iIndex+1) >= p->iDataLen)  {
                // No more needed.
                // return NACK for data byte
                AA_CLEAR(p);
            } else {
                // More bytes needed.
                // return ACK for data byte
                AA_SET(p);
            }
            break;

        // Slave address + Read sent, NO ACK received
        case 0x48:
            // Generate a stop condition
            STA_CLEAR(p);
            STO_SET(p);
            p->iRequest->iStatus = I2C_ERROR;
            p->iDoneFlag = ETrue;
            p->iCompleteFunc(p->iCompleteWorkspace, p->iRequest);
            break;

        // Data byte received with ACK
        case 0x50:
            // Store received byte
            c = I2DAT_READ(p);
            if (p->iIndex < p->iDataLen)
                p->iData[p->iIndex++] = c;

