FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1768/LPC1768_I2C.c
            // Are we to receive more?
            STA_CLEAR(p);
            STO_CLEAR(p);
            if ((p->iIndex+1) >= p->iDataLen) {
                // return NACK for next data byte
                AA_CLEAR(p);
            } else {
                // return ACK for next data byte
                AA_SET(p);
            }
            break;

        // Data byte received with NACK (last byte)
        case 0x58:
            // Store last byte
            c = I2DAT_READ(p);
            if (p->iIndex < p->iDataLen)
                p->iData[p->iIndex++] = c;

            // Generate a stop condition, but report OK
            STA_CLEAR(p);
            STO_SET(p);
            p->iRequest->iStatus = I2C_OK;
            p->iDoneFlag = ETrue;
            p->iCompleteFunc(p->iCompleteWorkspace, p->iRequest);
            break;
#endif // COMPILE_I2C_MASTER_MODE

#if COMPILE_I2C_SLAVE_MODE
        // SLAVE RECEIVER
        case 0x60:
        case 0x68:
        case 0x70:
        case 0x78:
            // Start of slave transaction
            // slave address + W received, or general call address received,
            // or lost arbitration, slave address + W received, or
            // lost arbitration, general call address received.
            STA_CLEAR(p);
            STO_CLEAR(p);
            p->iIndex = 0;
            p->iDoneFlag = EFalse;
            // Is this the last byte?
            if (p->iI2CSlaveIsLastReceiveByte(p))  {
                // Not allowed to send more bytes
                AA_CLEAR(p);
            } else {
                // Allowed to send more bytes
                AA_SET(p);
            }
            break;
        case 0x80:
        case 0x90:
            // Data received
            p->iI2CSlaveReceiveByte(p, I2DAT_READ(p));
            p->iIndex++;
            STA_CLEAR(p);
            STO_CLEAR(p);
            // Is this the last byte?
            if (p->iI2CSlaveIsLastReceiveByte(p))  {
                // Not allowed to send more bytes
                AA_CLEAR(p);
            } else {
                // Allowed to send more bytes
                AA_SET(p);
            }
            break;
        case 0x88:
        case 0x98:
            // Data received, NACK returned (signaling last byte)
            p->iI2CSlaveReceiveByte(p, I2DAT_READ(p));
            p->iIndex++;
            p->iRequest->iStatus = I2C_OK;
            STA_CLEAR(p);
            STO_CLEAR(p);
            AA_SET(p);
            p->iDoneFlag = ETrue;
            p->iI2CTransferComplete(p);
            p->iCompleteFunc(p->iCompleteWorkspace, p->iRequest);
            break;
        case 0xA0:
            // Stop condition received
            p->iRequest->iStatus = I2C_OK;
            STA_CLEAR(p);
            STO_CLEAR(p);
            AA_SET(p);
            p->iDoneFlag = ETrue;
            p->iI2CTransferComplete(p);
            p->iCompleteFunc(p->iCompleteWorkspace, p->iRequest);
            break;

        // SLAVE TRANSMITTER
        // ACK returned on Slave Address + R received; or
        // arbitration lost, slave address + R received, ACK returned; or
        // data byte transmitted, ACK received
        case 0xA8:
        case 0xB0:
            p->iIndex = 0;
        case 0xB8:
            c = p->iI2CSlaveGetTransmitByte(p);
            p->iIndex++;
            I2DAT_WRITE(p, c);
            STA_CLEAR(p);
            STO_CLEAR(p);
            if (p->iI2CSlaveIsLastTransmitByte(p))  {
                // No more data
                AA_CLEAR(p);
            } else {
                // more data bytes to transmit
                AA_SET(p);
            }
            break;
        case 0xC0:
        case 0xC8:
            // data byte transmitted, NACK received
            // last data byte transmitted, NACK received
            p->iRequest->iStatus = I2C_OK;
            STA_CLEAR(p);
            STO_CLEAR(p);
            AA_SET(p);
            p->iDoneFlag = ETrue;
            p->iI2CTransferComplete(p);
            p->iCompleteFunc(p->iCompleteWorkspace, p->iRequest);
            break;
#endif // #if COMPILE_I2C_SLAVE_MODE

        // Unhandled state
        default:
            // Generate a stop condition
            STA_CLEAR(p);
            STO_CLEAR(p);
            AA_SET(p);
            p->iRequest->iStatus = I2C_ERROR;
            p->iDoneFlag = ETrue;
#if COMPILE_I2C_SLAVE_MODE
            p->iI2CTransferComplete(p);
#endif
            p->iCompleteFunc(p->iCompleteWorkspace, p->iRequest);
            break;
    }

    // clear interrupt flag
    SI_CLEAR(p);
}

T_uezError ILPC1768_I2C_IsHung(void *aWorkspace, TBool *aBool)
{
    T_uezError error = UEZ_ERROR_NONE;
    T_LPC1768_I2C_Workspace *p = (T_LPC1768_I2C_Workspace *)aWorkspace;
    TBool sda, scl;

    sda = UEZGPIORead(p->iSDAPin);
    scl = UEZGPIORead(p->iSCLPin);

    *aBool = (!scl || !sda) ? ETrue : EFalse;

    return error;
}

T_uezError ILPC1768_I2C_ResetBus(void *aWorkspace)
{
    T_uezError error = UEZ_ERROR_NONE;
    //T_LPC1768_I2C_Workspace *p = (T_LPC1768_I2C_Workspace *)aWorkspace;
    //TODO: implement reset functionality.

    return error;
}

IRQ_ROUTINE(ILPC1768_I2C0InterruptHandler)
{
    IRQ_START();
    ILPC1768_ProcessState(G_lpc1768_i2c0Workspace);
    IRQ_END();
}

IRQ_ROUTINE(ILPC1768_I2C1InterruptHandler)
{
    IRQ_START();
    ILPC1768_ProcessState(G_lpc1768_i2c1Workspace);
    IRQ_END();
}

IRQ_ROUTINE(ILPC1768_I2C2InterruptHandler)
{
    IRQ_START();
    ILPC1768_ProcessState(G_lpc1768_i2c2Workspace);
    IRQ_END();
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1768_I2C_Bus0_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the LPC1768 I2C Bus0 workspace.
 * Inputs:
 *      void *aW                    -- Particular I2C workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC1768_I2C_Bus0_InitializeWorkspace(void *aWorkspace)
{
    T_LPC1768_I2C_Workspace *p = (T_LPC1768_I2C_Workspace *)aWorkspace;
    p->iRegs = LPC_I2C0;
    p->iDoneFlag = ETrue;
    p->iCompleteFunc = 0;
    G_lpc1768_i2c0Workspace = p;

